SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_rac.h
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p88                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p88 << 15)              /**< Shifted mode v0p88 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p91                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p91 << 15)              /**< Shifted mode v0p91 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p94                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p94 << 15)              /**< Shifted mode v0p94 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p97                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v0p97 << 15)              /**< Shifted mode v0p97 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p00                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p00 << 15)              /**< Shifted mode v1p00 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p03                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p03 << 15)              /**< Shifted mode v1p03 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p06                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p06 << 15)              /**< Shifted mode v1p06 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p09                         (_RAC_IFADCTRIM_IFADCREFBUFAMPLVL_v1p09 << 15)              /**< Shifted mode v1p09 for RAC_IFADCTRIM        */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_SHIFT                        18                                                          /**< Shift value for RAC_IFADCREFBUFCURLVL       */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_MASK                         0xC0000UL                                                   /**< Bit mask for RAC_IFADCREFBUFCURLVL          */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_DEFAULT                      0x00000001UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_65uA                 0x00000000UL                                                /**< Mode current_65uA for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_75uA                 0x00000001UL                                                /**< Mode current_75uA for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_85uA                 0x00000002UL                                                /**< Mode current_85uA for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_95uA                 0x00000003UL                                                /**< Mode current_95uA for RAC_IFADCTRIM         */
#define RAC_IFADCTRIM_IFADCREFBUFCURLVL_DEFAULT                       (_RAC_IFADCTRIM_IFADCREFBUFCURLVL_DEFAULT << 18)            /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_65uA                  (_RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_65uA << 18)       /**< Shifted mode current_65uA for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_75uA                  (_RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_75uA << 18)       /**< Shifted mode current_75uA for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_85uA                  (_RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_85uA << 18)       /**< Shifted mode current_85uA for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_95uA                  (_RAC_IFADCTRIM_IFADCREFBUFCURLVL_current_95uA << 18)       /**< Shifted mode current_95uA for RAC_IFADCTRIM */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_SHIFT                         20                                                          /**< Shift value for RAC_IFADCSIDETONEAMP        */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_MASK                          0x300000UL                                                  /**< Bit mask for RAC_IFADCSIDETONEAMP           */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_DEFAULT                       0x00000001UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_10mV                  0x00000000UL                                                /**< Mode diff_pk_10mV for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_20mV                  0x00000001UL                                                /**< Mode diff_pk_20mV for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_50mV                  0x00000002UL                                                /**< Mode diff_pk_50mV for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_100mV                 0x00000003UL                                                /**< Mode diff_pk_100mV for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCSIDETONEAMP_DEFAULT                        (_RAC_IFADCTRIM_IFADCSIDETONEAMP_DEFAULT << 20)             /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_10mV                   (_RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_10mV << 20)        /**< Shifted mode diff_pk_10mV for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_20mV                   (_RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_20mV << 20)        /**< Shifted mode diff_pk_20mV for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_50mV                   (_RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_50mV << 20)        /**< Shifted mode diff_pk_50mV for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_100mV                  (_RAC_IFADCTRIM_IFADCSIDETONEAMP_diff_pk_100mV << 20)       /**< Shifted mode diff_pk_100mV for RAC_IFADCTRIM*/
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_SHIFT                        22                                                          /**< Shift value for RAC_IFADCSIDETONEFREQ       */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_MASK                         0x1C00000UL                                                 /**< Bit mask for RAC_IFADCSIDETONEFREQ          */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_DEFAULT                      0x00000002UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_na0                          0x00000000UL                                                /**< Mode na0 for RAC_IFADCTRIM                  */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_128                      0x00000001UL                                                /**< Mode div_128 for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_64                       0x00000002UL                                                /**< Mode div_64 for RAC_IFADCTRIM               */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_32                       0x00000003UL                                                /**< Mode div_32 for RAC_IFADCTRIM               */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_16                       0x00000004UL                                                /**< Mode div_16 for RAC_IFADCTRIM               */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_8                        0x00000005UL                                                /**< Mode div_8 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_4                        0x00000006UL                                                /**< Mode div_4 for RAC_IFADCTRIM                */
#define _RAC_IFADCTRIM_IFADCSIDETONEFREQ_na7                          0x00000007UL                                                /**< Mode na7 for RAC_IFADCTRIM                  */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_DEFAULT                       (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_DEFAULT << 22)            /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_na0                           (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_na0 << 22)                /**< Shifted mode na0 for RAC_IFADCTRIM          */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_128                       (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_128 << 22)            /**< Shifted mode div_128 for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_64                        (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_64 << 22)             /**< Shifted mode div_64 for RAC_IFADCTRIM       */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_32                        (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_32 << 22)             /**< Shifted mode div_32 for RAC_IFADCTRIM       */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_16                        (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_16 << 22)             /**< Shifted mode div_16 for RAC_IFADCTRIM       */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_8                         (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_8 << 22)              /**< Shifted mode div_8 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_4                         (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_div_4 << 22)              /**< Shifted mode div_4 for RAC_IFADCTRIM        */
#define RAC_IFADCTRIM_IFADCSIDETONEFREQ_na7                           (_RAC_IFADCTRIM_IFADCSIDETONEFREQ_na7 << 22)                /**< Shifted mode na7 for RAC_IFADCTRIM          */
#define RAC_IFADCTRIM_IFADCTUNEZERO                                   (0x1UL << 25)                                               /**< IFADCTUNEZERO                               */
#define _RAC_IFADCTRIM_IFADCTUNEZERO_SHIFT                            25                                                          /**< Shift value for RAC_IFADCTUNEZERO           */
#define _RAC_IFADCTRIM_IFADCTUNEZERO_MASK                             0x2000000UL                                                 /**< Bit mask for RAC_IFADCTUNEZERO              */
#define _RAC_IFADCTRIM_IFADCTUNEZERO_DEFAULT                          0x00000000UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCTUNEZERO_nominal_zero                     0x00000000UL                                                /**< Mode nominal_zero for RAC_IFADCTRIM         */
#define _RAC_IFADCTRIM_IFADCTUNEZERO_half_freq_zero                   0x00000001UL                                                /**< Mode half_freq_zero for RAC_IFADCTRIM       */
#define RAC_IFADCTRIM_IFADCTUNEZERO_DEFAULT                           (_RAC_IFADCTRIM_IFADCTUNEZERO_DEFAULT << 25)                /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCTUNEZERO_nominal_zero                      (_RAC_IFADCTRIM_IFADCTUNEZERO_nominal_zero << 25)           /**< Shifted mode nominal_zero for RAC_IFADCTRIM */
#define RAC_IFADCTRIM_IFADCTUNEZERO_half_freq_zero                    (_RAC_IFADCTRIM_IFADCTUNEZERO_half_freq_zero << 25)         /**< Shifted mode half_freq_zero for RAC_IFADCTRIM*/
#define _RAC_IFADCTRIM_IFADCVCMLVL_SHIFT                              26                                                          /**< Shift value for RAC_IFADCVCMLVL             */
#define _RAC_IFADCTRIM_IFADCVCMLVL_MASK                               0xC000000UL                                                 /**< Bit mask for RAC_IFADCVCMLVL                */
#define _RAC_IFADCTRIM_IFADCVCMLVL_DEFAULT                            0x00000002UL                                                /**< Mode DEFAULT for RAC_IFADCTRIM              */
#define _RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p48                         0x00000000UL                                                /**< Mode ratio_0p48 for RAC_IFADCTRIM           */
#define _RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p49                         0x00000001UL                                                /**< Mode ratio_0p49 for RAC_IFADCTRIM           */
#define _RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p5                          0x00000002UL                                                /**< Mode ratio_0p5 for RAC_IFADCTRIM            */
#define _RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p52                         0x00000003UL                                                /**< Mode ratio_0p52 for RAC_IFADCTRIM           */
#define RAC_IFADCTRIM_IFADCVCMLVL_DEFAULT                             (_RAC_IFADCTRIM_IFADCVCMLVL_DEFAULT << 26)                  /**< Shifted mode DEFAULT for RAC_IFADCTRIM      */
#define RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p48                          (_RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p48 << 26)               /**< Shifted mode ratio_0p48 for RAC_IFADCTRIM   */
#define RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p49                          (_RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p49 << 26)               /**< Shifted mode ratio_0p49 for RAC_IFADCTRIM   */
#define RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p5                           (_RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p5 << 26)                /**< Shifted mode ratio_0p5 for RAC_IFADCTRIM    */
#define RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p52                          (_RAC_IFADCTRIM_IFADCVCMLVL_ratio_0p52 << 26)               /**< Shifted mode ratio_0p52 for RAC_IFADCTRIM   */

/* Bit fields for RAC IFADCCAL */
#define _RAC_IFADCCAL_RESETVALUE                                      0x00001000UL                                    /**< Default value for RAC_IFADCCAL              */
#define _RAC_IFADCCAL_MASK                                            0x00001F03UL                                    /**< Mask for RAC_IFADCCAL                       */
#define RAC_IFADCCAL_IFADCENRCCAL                                     (0x1UL << 0)                                    /**< IFADCENRCCAL                                */
#define _RAC_IFADCCAL_IFADCENRCCAL_SHIFT                              0                                               /**< Shift value for RAC_IFADCENRCCAL            */
#define _RAC_IFADCCAL_IFADCENRCCAL_MASK                               0x1UL                                           /**< Bit mask for RAC_IFADCENRCCAL               */
#define _RAC_IFADCCAL_IFADCENRCCAL_DEFAULT                            0x00000000UL                                    /**< Mode DEFAULT for RAC_IFADCCAL               */
#define _RAC_IFADCCAL_IFADCENRCCAL_rccal_disable                      0x00000000UL                                    /**< Mode rccal_disable for RAC_IFADCCAL         */
#define _RAC_IFADCCAL_IFADCENRCCAL_rccal_enable                       0x00000001UL                                    /**< Mode rccal_enable for RAC_IFADCCAL          */
#define RAC_IFADCCAL_IFADCENRCCAL_DEFAULT                             (_RAC_IFADCCAL_IFADCENRCCAL_DEFAULT << 0)       /**< Shifted mode DEFAULT for RAC_IFADCCAL       */
#define RAC_IFADCCAL_IFADCENRCCAL_rccal_disable                       (_RAC_IFADCCAL_IFADCENRCCAL_rccal_disable << 0) /**< Shifted mode rccal_disable for RAC_IFADCCAL */
#define RAC_IFADCCAL_IFADCENRCCAL_rccal_enable                        (_RAC_IFADCCAL_IFADCENRCCAL_rccal_enable << 0)  /**< Shifted mode rccal_enable for RAC_IFADCCAL  */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE                               (0x1UL << 1)                                    /**< IFADCTUNERCCALMODE                          */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_SHIFT                        1                                               /**< Shift value for RAC_IFADCTUNERCCALMODE      */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_MASK                         0x2UL                                           /**< Bit mask for RAC_IFADCTUNERCCALMODE         */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_DEFAULT                      0x00000000UL                                    /**< Mode DEFAULT for RAC_IFADCCAL               */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_SYmode                       0x00000000UL                                    /**< Mode SYmode for RAC_IFADCCAL                */
#define _RAC_IFADCCAL_IFADCTUNERCCALMODE_ADCmode                      0x00000001UL                                    /**< Mode ADCmode for RAC_IFADCCAL               */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE_DEFAULT                       (_RAC_IFADCCAL_IFADCTUNERCCALMODE_DEFAULT << 1) /**< Shifted mode DEFAULT for RAC_IFADCCAL       */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE_SYmode                        (_RAC_IFADCCAL_IFADCTUNERCCALMODE_SYmode << 1)  /**< Shifted mode SYmode for RAC_IFADCCAL        */
#define RAC_IFADCCAL_IFADCTUNERCCALMODE_ADCmode                       (_RAC_IFADCCAL_IFADCTUNERCCALMODE_ADCmode << 1) /**< Shifted mode ADCmode for RAC_IFADCCAL       */
#define _RAC_IFADCCAL_IFADCTUNERC_SHIFT                               8                                               /**< Shift value for RAC_IFADCTUNERC             */
#define _RAC_IFADCCAL_IFADCTUNERC_MASK                                0x1F00UL                                        /**< Bit mask for RAC_IFADCTUNERC                */
#define _RAC_IFADCCAL_IFADCTUNERC_DEFAULT                             0x00000010UL                                    /**< Mode DEFAULT for RAC_IFADCCAL               */
#define RAC_IFADCCAL_IFADCTUNERC_DEFAULT                              (_RAC_IFADCCAL_IFADCTUNERC_DEFAULT << 8)        /**< Shifted mode DEFAULT for RAC_IFADCCAL       */

/* Bit fields for RAC IFADCSTATUS */
#define _RAC_IFADCSTATUS_RESETVALUE                                   0x00000000UL                                  /**< Default value for RAC_IFADCSTATUS           */
#define _RAC_IFADCSTATUS_MASK                                         0x00000001UL                                  /**< Mask for RAC_IFADCSTATUS                    */
#define RAC_IFADCSTATUS_IFADCRCCALOUT                                 (0x1UL << 0)                                  /**< IFADCRCCALOUT                               */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_SHIFT                          0                                             /**< Shift value for RAC_IFADCRCCALOUT           */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_MASK                           0x1UL                                         /**< Bit mask for RAC_IFADCRCCALOUT              */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_DEFAULT                        0x00000000UL                                  /**< Mode DEFAULT for RAC_IFADCSTATUS            */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_lo                             0x00000000UL                                  /**< Mode lo for RAC_IFADCSTATUS                 */
#define _RAC_IFADCSTATUS_IFADCRCCALOUT_hi                             0x00000001UL                                  /**< Mode hi for RAC_IFADCSTATUS                 */
#define RAC_IFADCSTATUS_IFADCRCCALOUT_DEFAULT                         (_RAC_IFADCSTATUS_IFADCRCCALOUT_DEFAULT << 0) /**< Shifted mode DEFAULT for RAC_IFADCSTATUS    */
#define RAC_IFADCSTATUS_IFADCRCCALOUT_lo                              (_RAC_IFADCSTATUS_IFADCRCCALOUT_lo << 0)      /**< Shifted mode lo for RAC_IFADCSTATUS         */
#define RAC_IFADCSTATUS_IFADCRCCALOUT_hi                              (_RAC_IFADCSTATUS_IFADCRCCALOUT_hi << 0)      /**< Shifted mode hi for RAC_IFADCSTATUS         */

