SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_rac.h
/* Bit fields for RAC RFPATHEN2 */
#define _RAC_RFPATHEN2_RESETVALUE                                     0x00000004UL                                        /**< Default value for RAC_RFPATHEN2             */
#define _RAC_RFPATHEN2_MASK                                           0x000000FFUL                                        /**< Mask for RAC_RFPATHEN2                      */
#define RAC_RFPATHEN2_LNAMIXEN0DBMPA2                                 (0x1UL << 0)                                        /**< LNAMIXEN0DBMPA2                             */
#define _RAC_RFPATHEN2_LNAMIXEN0DBMPA2_SHIFT                          0                                                   /**< Shift value for RAC_LNAMIXEN0DBMPA2         */
#define _RAC_RFPATHEN2_LNAMIXEN0DBMPA2_MASK                           0x1UL                                               /**< Bit mask for RAC_LNAMIXEN0DBMPA2            */
#define _RAC_RFPATHEN2_LNAMIXEN0DBMPA2_DEFAULT                        0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXEN0DBMPA2_disable                        0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXEN0DBMPA2_enable                         0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_LNAMIXEN0DBMPA2_DEFAULT                         (_RAC_RFPATHEN2_LNAMIXEN0DBMPA2_DEFAULT << 0)       /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXEN0DBMPA2_disable                         (_RAC_RFPATHEN2_LNAMIXEN0DBMPA2_disable << 0)       /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXEN0DBMPA2_enable                          (_RAC_RFPATHEN2_LNAMIXEN0DBMPA2_enable << 0)        /**< Shifted mode enable for RAC_RFPATHEN2       */
#define RAC_RFPATHEN2_LNAMIXEN2                                       (0x1UL << 1)                                        /**< LNAMIXEN2                                   */
#define _RAC_RFPATHEN2_LNAMIXEN2_SHIFT                                1                                                   /**< Shift value for RAC_LNAMIXEN2               */
#define _RAC_RFPATHEN2_LNAMIXEN2_MASK                                 0x2UL                                               /**< Bit mask for RAC_LNAMIXEN2                  */
#define _RAC_RFPATHEN2_LNAMIXEN2_DEFAULT                              0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXEN2_disable                              0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXEN2_enable                               0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_LNAMIXEN2_DEFAULT                               (_RAC_RFPATHEN2_LNAMIXEN2_DEFAULT << 1)             /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXEN2_disable                               (_RAC_RFPATHEN2_LNAMIXEN2_disable << 1)             /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXEN2_enable                                (_RAC_RFPATHEN2_LNAMIXEN2_enable << 1)              /**< Shifted mode enable for RAC_RFPATHEN2       */
#define RAC_RFPATHEN2_LNAMIXRFATTDCEN2                                (0x1UL << 2)                                        /**< LNAMIXRFATTDCEN2                            */
#define _RAC_RFPATHEN2_LNAMIXRFATTDCEN2_SHIFT                         2                                                   /**< Shift value for RAC_LNAMIXRFATTDCEN2        */
#define _RAC_RFPATHEN2_LNAMIXRFATTDCEN2_MASK                          0x4UL                                               /**< Bit mask for RAC_LNAMIXRFATTDCEN2           */
#define _RAC_RFPATHEN2_LNAMIXRFATTDCEN2_DEFAULT                       0x00000001UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXRFATTDCEN2_disable                       0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXRFATTDCEN2_enable                        0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_LNAMIXRFATTDCEN2_DEFAULT                        (_RAC_RFPATHEN2_LNAMIXRFATTDCEN2_DEFAULT << 2)      /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXRFATTDCEN2_disable                        (_RAC_RFPATHEN2_LNAMIXRFATTDCEN2_disable << 2)      /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXRFATTDCEN2_enable                         (_RAC_RFPATHEN2_LNAMIXRFATTDCEN2_enable << 2)       /**< Shifted mode enable for RAC_RFPATHEN2       */
#define RAC_RFPATHEN2_LNAMIXRFPKDENRF2                                (0x1UL << 3)                                        /**< LNAMIXRFPKDENRF2                            */
#define _RAC_RFPATHEN2_LNAMIXRFPKDENRF2_SHIFT                         3                                                   /**< Shift value for RAC_LNAMIXRFPKDENRF2        */
#define _RAC_RFPATHEN2_LNAMIXRFPKDENRF2_MASK                          0x8UL                                               /**< Bit mask for RAC_LNAMIXRFPKDENRF2           */
#define _RAC_RFPATHEN2_LNAMIXRFPKDENRF2_DEFAULT                       0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXRFPKDENRF2_disable                       0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXRFPKDENRF2_enable_path2                  0x00000001UL                                        /**< Mode enable_path2 for RAC_RFPATHEN2         */
#define RAC_RFPATHEN2_LNAMIXRFPKDENRF2_DEFAULT                        (_RAC_RFPATHEN2_LNAMIXRFPKDENRF2_DEFAULT << 3)      /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXRFPKDENRF2_disable                        (_RAC_RFPATHEN2_LNAMIXRFPKDENRF2_disable << 3)      /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXRFPKDENRF2_enable_path2                   (_RAC_RFPATHEN2_LNAMIXRFPKDENRF2_enable_path2 << 3) /**< Shifted mode enable_path2 for RAC_RFPATHEN2 */
#define RAC_RFPATHEN2_LNAMIXTRSW2                                     (0x1UL << 4)                                        /**< LNAMIXTRSW2                                 */
#define _RAC_RFPATHEN2_LNAMIXTRSW2_SHIFT                              4                                                   /**< Shift value for RAC_LNAMIXTRSW2             */
#define _RAC_RFPATHEN2_LNAMIXTRSW2_MASK                               0x10UL                                              /**< Bit mask for RAC_LNAMIXTRSW2                */
#define _RAC_RFPATHEN2_LNAMIXTRSW2_DEFAULT                            0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXTRSW2_disable                            0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_LNAMIXTRSW2_enable                             0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_LNAMIXTRSW2_DEFAULT                             (_RAC_RFPATHEN2_LNAMIXTRSW2_DEFAULT << 4)           /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXTRSW2_disable                             (_RAC_RFPATHEN2_LNAMIXTRSW2_disable << 4)           /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_LNAMIXTRSW2_enable                              (_RAC_RFPATHEN2_LNAMIXTRSW2_enable << 4)            /**< Shifted mode enable for RAC_RFPATHEN2       */
#define RAC_RFPATHEN2_PAENANT2                                        (0x1UL << 5)                                        /**< PAENANT2                                    */
#define _RAC_RFPATHEN2_PAENANT2_SHIFT                                 5                                                   /**< Shift value for RAC_PAENANT2                */
#define _RAC_RFPATHEN2_PAENANT2_MASK                                  0x20UL                                              /**< Bit mask for RAC_PAENANT2                   */
#define _RAC_RFPATHEN2_PAENANT2_DEFAULT                               0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_PAENANT2_disable                               0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_PAENANT2_enable                                0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_PAENANT2_DEFAULT                                (_RAC_RFPATHEN2_PAENANT2_DEFAULT << 5)              /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_PAENANT2_disable                                (_RAC_RFPATHEN2_PAENANT2_disable << 5)              /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_PAENANT2_enable                                 (_RAC_RFPATHEN2_PAENANT2_enable << 5)               /**< Shifted mode enable for RAC_RFPATHEN2       */
#define RAC_RFPATHEN2_PAENPA20DBM                                     (0x1UL << 6)                                        /**< PAENPA20DBM                                 */
#define _RAC_RFPATHEN2_PAENPA20DBM_SHIFT                              6                                                   /**< Shift value for RAC_PAENPA20DBM             */
#define _RAC_RFPATHEN2_PAENPA20DBM_MASK                               0x40UL                                              /**< Bit mask for RAC_PAENPA20DBM                */
#define _RAC_RFPATHEN2_PAENPA20DBM_DEFAULT                            0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_PAENPA20DBM_disable                            0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_PAENPA20DBM_enable                             0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_PAENPA20DBM_DEFAULT                             (_RAC_RFPATHEN2_PAENPA20DBM_DEFAULT << 6)           /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_PAENPA20DBM_disable                             (_RAC_RFPATHEN2_PAENPA20DBM_disable << 6)           /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_PAENPA20DBM_enable                              (_RAC_RFPATHEN2_PAENPA20DBM_enable << 6)            /**< Shifted mode enable for RAC_RFPATHEN2       */
#define RAC_RFPATHEN2_PAENPAPREDRV20DBM                               (0x1UL << 7)                                        /**< PAENPAPREDRV20DBM                           */
#define _RAC_RFPATHEN2_PAENPAPREDRV20DBM_SHIFT                        7                                                   /**< Shift value for RAC_PAENPAPREDRV20DBM       */
#define _RAC_RFPATHEN2_PAENPAPREDRV20DBM_MASK                         0x80UL                                              /**< Bit mask for RAC_PAENPAPREDRV20DBM          */
#define _RAC_RFPATHEN2_PAENPAPREDRV20DBM_DEFAULT                      0x00000000UL                                        /**< Mode DEFAULT for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_PAENPAPREDRV20DBM_disable                      0x00000000UL                                        /**< Mode disable for RAC_RFPATHEN2              */
#define _RAC_RFPATHEN2_PAENPAPREDRV20DBM_enable                       0x00000001UL                                        /**< Mode enable for RAC_RFPATHEN2               */
#define RAC_RFPATHEN2_PAENPAPREDRV20DBM_DEFAULT                       (_RAC_RFPATHEN2_PAENPAPREDRV20DBM_DEFAULT << 7)     /**< Shifted mode DEFAULT for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_PAENPAPREDRV20DBM_disable                       (_RAC_RFPATHEN2_PAENPAPREDRV20DBM_disable << 7)     /**< Shifted mode disable for RAC_RFPATHEN2      */
#define RAC_RFPATHEN2_PAENPAPREDRV20DBM_enable                        (_RAC_RFPATHEN2_PAENPAPREDRV20DBM_enable << 7)      /**< Shifted mode enable for RAC_RFPATHEN2       */

