SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_rac.h
/* Bit fields for RAC TX */
#define _RAC_TX_RESETVALUE                                            0x00000000UL                                /**< Default value for RAC_TX                    */
#define _RAC_TX_MASK                                                  0xFF3707FFUL                                /**< Mask for RAC_TX                             */
#define RAC_TX_PABLEEDDRVREG0DBM                                      (0x1UL << 0)                                /**< PABLEEDDRVREG0DBM                           */
#define _RAC_TX_PABLEEDDRVREG0DBM_SHIFT                               0                                           /**< Shift value for RAC_PABLEEDDRVREG0DBM       */
#define _RAC_TX_PABLEEDDRVREG0DBM_MASK                                0x1UL                                       /**< Bit mask for RAC_PABLEEDDRVREG0DBM          */
#define _RAC_TX_PABLEEDDRVREG0DBM_DEFAULT                             0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PABLEEDDRVREG0DBM_disable                             0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PABLEEDDRVREG0DBM_enable                              0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PABLEEDDRVREG0DBM_DEFAULT                              (_RAC_TX_PABLEEDDRVREG0DBM_DEFAULT << 0)    /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PABLEEDDRVREG0DBM_disable                              (_RAC_TX_PABLEEDDRVREG0DBM_disable << 0)    /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PABLEEDDRVREG0DBM_enable                               (_RAC_TX_PABLEEDDRVREG0DBM_enable << 0)     /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PABLEEDREG0DBM                                         (0x1UL << 1)                                /**< PABLEEDREG0DBM                              */
#define _RAC_TX_PABLEEDREG0DBM_SHIFT                                  1                                           /**< Shift value for RAC_PABLEEDREG0DBM          */
#define _RAC_TX_PABLEEDREG0DBM_MASK                                   0x2UL                                       /**< Bit mask for RAC_PABLEEDREG0DBM             */
#define _RAC_TX_PABLEEDREG0DBM_DEFAULT                                0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PABLEEDREG0DBM_disable                                0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PABLEEDREG0DBM_enable                                 0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PABLEEDREG0DBM_DEFAULT                                 (_RAC_TX_PABLEEDREG0DBM_DEFAULT << 1)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PABLEEDREG0DBM_disable                                 (_RAC_TX_PABLEEDREG0DBM_disable << 1)       /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PABLEEDREG0DBM_enable                                  (_RAC_TX_PABLEEDREG0DBM_enable << 1)        /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENBIAS0DBM                                           (0x1UL << 2)                                /**< PAENBIAS0DBM                                */
#define _RAC_TX_PAENBIAS0DBM_SHIFT                                    2                                           /**< Shift value for RAC_PAENBIAS0DBM            */
#define _RAC_TX_PAENBIAS0DBM_MASK                                     0x4UL                                       /**< Bit mask for RAC_PAENBIAS0DBM               */
#define _RAC_TX_PAENBIAS0DBM_DEFAULT                                  0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENBIAS0DBM_disable                                  0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENBIAS0DBM_enable                                   0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENBIAS0DBM_DEFAULT                                   (_RAC_TX_PAENBIAS0DBM_DEFAULT << 2)         /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENBIAS0DBM_disable                                   (_RAC_TX_PAENBIAS0DBM_disable << 2)         /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENBIAS0DBM_enable                                    (_RAC_TX_PAENBIAS0DBM_enable << 2)          /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENDRVREG0DBM                                         (0x1UL << 3)                                /**< PAENDRVREG0DBM                              */
#define _RAC_TX_PAENDRVREG0DBM_SHIFT                                  3                                           /**< Shift value for RAC_PAENDRVREG0DBM          */
#define _RAC_TX_PAENDRVREG0DBM_MASK                                   0x8UL                                       /**< Bit mask for RAC_PAENDRVREG0DBM             */
#define _RAC_TX_PAENDRVREG0DBM_DEFAULT                                0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENDRVREG0DBM_disable                                0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENDRVREG0DBM_enable                                 0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENDRVREG0DBM_DEFAULT                                 (_RAC_TX_PAENDRVREG0DBM_DEFAULT << 3)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENDRVREG0DBM_disable                                 (_RAC_TX_PAENDRVREG0DBM_disable << 3)       /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENDRVREG0DBM_enable                                  (_RAC_TX_PAENDRVREG0DBM_enable << 3)        /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENDRVREGBIAS0DBM                                     (0x1UL << 4)                                /**< PAENDRVREGBIAS0DBM                          */
#define _RAC_TX_PAENDRVREGBIAS0DBM_SHIFT                              4                                           /**< Shift value for RAC_PAENDRVREGBIAS0DBM      */
#define _RAC_TX_PAENDRVREGBIAS0DBM_MASK                               0x10UL                                      /**< Bit mask for RAC_PAENDRVREGBIAS0DBM         */
#define _RAC_TX_PAENDRVREGBIAS0DBM_DEFAULT                            0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENDRVREGBIAS0DBM_disable                            0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENDRVREGBIAS0DBM_enable                             0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENDRVREGBIAS0DBM_DEFAULT                             (_RAC_TX_PAENDRVREGBIAS0DBM_DEFAULT << 4)   /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENDRVREGBIAS0DBM_disable                             (_RAC_TX_PAENDRVREGBIAS0DBM_disable << 4)   /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENDRVREGBIAS0DBM_enable                              (_RAC_TX_PAENDRVREGBIAS0DBM_enable << 4)    /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENLO0DBM                                             (0x1UL << 5)                                /**< PAENLO0DBM                                  */
#define _RAC_TX_PAENLO0DBM_SHIFT                                      5                                           /**< Shift value for RAC_PAENLO0DBM              */
#define _RAC_TX_PAENLO0DBM_MASK                                       0x20UL                                      /**< Bit mask for RAC_PAENLO0DBM                 */
#define _RAC_TX_PAENLO0DBM_DEFAULT                                    0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENLO0DBM_disable                                    0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENLO0DBM_enable                                     0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENLO0DBM_DEFAULT                                     (_RAC_TX_PAENLO0DBM_DEFAULT << 5)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENLO0DBM_disable                                     (_RAC_TX_PAENLO0DBM_disable << 5)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENLO0DBM_enable                                      (_RAC_TX_PAENLO0DBM_enable << 5)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENREG0DBM                                            (0x1UL << 6)                                /**< PAENREG0DBM                                 */
#define _RAC_TX_PAENREG0DBM_SHIFT                                     6                                           /**< Shift value for RAC_PAENREG0DBM             */
#define _RAC_TX_PAENREG0DBM_MASK                                      0x40UL                                      /**< Bit mask for RAC_PAENREG0DBM                */
#define _RAC_TX_PAENREG0DBM_DEFAULT                                   0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENREG0DBM_disable                                   0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENREG0DBM_enable                                    0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENREG0DBM_DEFAULT                                    (_RAC_TX_PAENREG0DBM_DEFAULT << 6)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENREG0DBM_disable                                    (_RAC_TX_PAENREG0DBM_disable << 6)          /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENREG0DBM_enable                                     (_RAC_TX_PAENREG0DBM_enable << 6)           /**< Shifted mode enable for RAC_TX              */
#define _RAC_TX_PAENTAPCAP0DBM_SHIFT                                  7                                           /**< Shift value for RAC_PAENTAPCAP0DBM          */
#define _RAC_TX_PAENTAPCAP0DBM_MASK                                   0x380UL                                     /**< Bit mask for RAC_PAENTAPCAP0DBM             */
#define _RAC_TX_PAENTAPCAP0DBM_DEFAULT                                0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENTAPCAP0DBM_cap_0f                                 0x00000000UL                                /**< Mode cap_0f for RAC_TX                      */
#define _RAC_TX_PAENTAPCAP0DBM_cap_0p35pF                             0x00000001UL                                /**< Mode cap_0p35pF for RAC_TX                  */
#define _RAC_TX_PAENTAPCAP0DBM_cap_0p7pF                              0x00000002UL                                /**< Mode cap_0p7pF for RAC_TX                   */
#define _RAC_TX_PAENTAPCAP0DBM_cap_1p05pF                             0x00000003UL                                /**< Mode cap_1p05pF for RAC_TX                  */
#define _RAC_TX_PAENTAPCAP0DBM_cap_1p4pF                              0x00000004UL                                /**< Mode cap_1p4pF for RAC_TX                   */
#define _RAC_TX_PAENTAPCAP0DBM_cap_1p75pF                             0x00000005UL                                /**< Mode cap_1p75pF for RAC_TX                  */
#define _RAC_TX_PAENTAPCAP0DBM_cap_2p1pF                              0x00000006UL                                /**< Mode cap_2p1pF for RAC_TX                   */
#define _RAC_TX_PAENTAPCAP0DBM_cap_2p45pF                             0x00000007UL                                /**< Mode cap_2p45pF for RAC_TX                  */
#define RAC_TX_PAENTAPCAP0DBM_DEFAULT                                 (_RAC_TX_PAENTAPCAP0DBM_DEFAULT << 7)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENTAPCAP0DBM_cap_0f                                  (_RAC_TX_PAENTAPCAP0DBM_cap_0f << 7)        /**< Shifted mode cap_0f for RAC_TX              */
#define RAC_TX_PAENTAPCAP0DBM_cap_0p35pF                              (_RAC_TX_PAENTAPCAP0DBM_cap_0p35pF << 7)    /**< Shifted mode cap_0p35pF for RAC_TX          */
#define RAC_TX_PAENTAPCAP0DBM_cap_0p7pF                               (_RAC_TX_PAENTAPCAP0DBM_cap_0p7pF << 7)     /**< Shifted mode cap_0p7pF for RAC_TX           */
#define RAC_TX_PAENTAPCAP0DBM_cap_1p05pF                              (_RAC_TX_PAENTAPCAP0DBM_cap_1p05pF << 7)    /**< Shifted mode cap_1p05pF for RAC_TX          */
#define RAC_TX_PAENTAPCAP0DBM_cap_1p4pF                               (_RAC_TX_PAENTAPCAP0DBM_cap_1p4pF << 7)     /**< Shifted mode cap_1p4pF for RAC_TX           */
#define RAC_TX_PAENTAPCAP0DBM_cap_1p75pF                              (_RAC_TX_PAENTAPCAP0DBM_cap_1p75pF << 7)    /**< Shifted mode cap_1p75pF for RAC_TX          */
#define RAC_TX_PAENTAPCAP0DBM_cap_2p1pF                               (_RAC_TX_PAENTAPCAP0DBM_cap_2p1pF << 7)     /**< Shifted mode cap_2p1pF for RAC_TX           */
#define RAC_TX_PAENTAPCAP0DBM_cap_2p45pF                              (_RAC_TX_PAENTAPCAP0DBM_cap_2p45pF << 7)    /**< Shifted mode cap_2p45pF for RAC_TX          */
#define RAC_TX_ENPATRIMPASLICE0DBM                                    (0x1UL << 10)                               /**< Override                                    */
#define _RAC_TX_ENPATRIMPASLICE0DBM_SHIFT                             10                                          /**< Shift value for RAC_ENPATRIMPASLICE0DBM     */
#define _RAC_TX_ENPATRIMPASLICE0DBM_MASK                              0x400UL                                     /**< Bit mask for RAC_ENPATRIMPASLICE0DBM        */
#define _RAC_TX_ENPATRIMPASLICE0DBM_DEFAULT                           0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPATRIMPASLICE0DBM_DEFAULT                            (_RAC_TX_ENPATRIMPASLICE0DBM_DEFAULT << 10) /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAEN10DBMM                                             (0x1UL << 16)                               /**< PAEN10DBMM                                  */
#define _RAC_TX_PAEN10DBMM_SHIFT                                      16                                          /**< Shift value for RAC_PAEN10DBMM              */
#define _RAC_TX_PAEN10DBMM_MASK                                       0x10000UL                                   /**< Bit mask for RAC_PAEN10DBMM                 */
#define _RAC_TX_PAEN10DBMM_DEFAULT                                    0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAEN10DBMM_disable                                    0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAEN10DBMM_enable                                     0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAEN10DBMM_DEFAULT                                     (_RAC_TX_PAEN10DBMM_DEFAULT << 16)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAEN10DBMM_disable                                     (_RAC_TX_PAEN10DBMM_disable << 16)          /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAEN10DBMM_enable                                      (_RAC_TX_PAEN10DBMM_enable << 16)           /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAEN10DBMP                                             (0x1UL << 17)                               /**< PAEN10DBMP                                  */
#define _RAC_TX_PAEN10DBMP_SHIFT                                      17                                          /**< Shift value for RAC_PAEN10DBMP              */
#define _RAC_TX_PAEN10DBMP_MASK                                       0x20000UL                                   /**< Bit mask for RAC_PAEN10DBMP                 */
#define _RAC_TX_PAEN10DBMP_DEFAULT                                    0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAEN10DBMP_disable                                    0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAEN10DBMP_enable                                     0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAEN10DBMP_DEFAULT                                     (_RAC_TX_PAEN10DBMP_DEFAULT << 17)          /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAEN10DBMP_disable                                     (_RAC_TX_PAEN10DBMP_disable << 17)          /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAEN10DBMP_enable                                      (_RAC_TX_PAEN10DBMP_enable << 17)           /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAEN10DBMPDRV                                          (0x1UL << 18)                               /**< PAEN10DBMPDRV                               */
#define _RAC_TX_PAEN10DBMPDRV_SHIFT                                   18                                          /**< Shift value for RAC_PAEN10DBMPDRV           */
#define _RAC_TX_PAEN10DBMPDRV_MASK                                    0x40000UL                                   /**< Bit mask for RAC_PAEN10DBMPDRV              */
#define _RAC_TX_PAEN10DBMPDRV_DEFAULT                                 0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAEN10DBMPDRV_disable                                 0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAEN10DBMPDRV_enable                                  0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAEN10DBMPDRV_DEFAULT                                  (_RAC_TX_PAEN10DBMPDRV_DEFAULT << 18)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAEN10DBMPDRV_disable                                  (_RAC_TX_PAEN10DBMPDRV_disable << 18)       /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAEN10DBMPDRV_enable                                   (_RAC_TX_PAEN10DBMPDRV_enable << 18)        /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAEN20DBM                                              (0x1UL << 20)                               /**< PAEN20DBM                                   */
#define _RAC_TX_PAEN20DBM_SHIFT                                       20                                          /**< Shift value for RAC_PAEN20DBM               */
#define _RAC_TX_PAEN20DBM_MASK                                        0x100000UL                                  /**< Bit mask for RAC_PAEN20DBM                  */
#define _RAC_TX_PAEN20DBM_DEFAULT                                     0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAEN20DBM_disable                                     0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAEN20DBM_enable                                      0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAEN20DBM_DEFAULT                                      (_RAC_TX_PAEN20DBM_DEFAULT << 20)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAEN20DBM_disable                                      (_RAC_TX_PAEN20DBM_disable << 20)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAEN20DBM_enable                                       (_RAC_TX_PAEN20DBM_enable << 20)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAEN20DBMPDRV                                          (0x1UL << 21)                               /**< PAEN20DBMPDRV                               */
#define _RAC_TX_PAEN20DBMPDRV_SHIFT                                   21                                          /**< Shift value for RAC_PAEN20DBMPDRV           */
#define _RAC_TX_PAEN20DBMPDRV_MASK                                    0x200000UL                                  /**< Bit mask for RAC_PAEN20DBMPDRV              */
#define _RAC_TX_PAEN20DBMPDRV_DEFAULT                                 0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAEN20DBMPDRV_disable                                 0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAEN20DBMPDRV_enable                                  0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAEN20DBMPDRV_DEFAULT                                  (_RAC_TX_PAEN20DBMPDRV_DEFAULT << 21)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAEN20DBMPDRV_disable                                  (_RAC_TX_PAEN20DBMPDRV_disable << 21)       /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAEN20DBMPDRV_enable                                   (_RAC_TX_PAEN20DBMPDRV_enable << 21)        /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENBLEEDPDRVLDO                                       (0x1UL << 24)                               /**< PAENBLEEDPDRVLDO                            */
#define _RAC_TX_PAENBLEEDPDRVLDO_SHIFT                                24                                          /**< Shift value for RAC_PAENBLEEDPDRVLDO        */
#define _RAC_TX_PAENBLEEDPDRVLDO_MASK                                 0x1000000UL                                 /**< Bit mask for RAC_PAENBLEEDPDRVLDO           */
#define _RAC_TX_PAENBLEEDPDRVLDO_DEFAULT                              0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENBLEEDPDRVLDO_disable                              0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENBLEEDPDRVLDO_enable                               0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENBLEEDPDRVLDO_DEFAULT                               (_RAC_TX_PAENBLEEDPDRVLDO_DEFAULT << 24)    /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENBLEEDPDRVLDO_disable                               (_RAC_TX_PAENBLEEDPDRVLDO_disable << 24)    /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENBLEEDPDRVLDO_enable                                (_RAC_TX_PAENBLEEDPDRVLDO_enable << 24)     /**< Shifted mode enable for RAC_TX              */
