SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM21/Include/bgm21_rac.h
#define RAC_TX_PAENBLEEDPREREG                                        (0x1UL << 25)                               /**< PAENBLEEDPREREG                             */
#define _RAC_TX_PAENBLEEDPREREG_SHIFT                                 25                                          /**< Shift value for RAC_PAENBLEEDPREREG         */
#define _RAC_TX_PAENBLEEDPREREG_MASK                                  0x2000000UL                                 /**< Bit mask for RAC_PAENBLEEDPREREG            */
#define _RAC_TX_PAENBLEEDPREREG_DEFAULT                               0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENBLEEDPREREG_disable                               0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENBLEEDPREREG_enable                                0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENBLEEDPREREG_DEFAULT                                (_RAC_TX_PAENBLEEDPREREG_DEFAULT << 25)     /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENBLEEDPREREG_disable                                (_RAC_TX_PAENBLEEDPREREG_disable << 25)     /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENBLEEDPREREG_enable                                 (_RAC_TX_PAENBLEEDPREREG_enable << 25)      /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENLDOHVPDRVLDO                                       (0x1UL << 26)                               /**< PAENLDOHVPDRVLDO                            */
#define _RAC_TX_PAENLDOHVPDRVLDO_SHIFT                                26                                          /**< Shift value for RAC_PAENLDOHVPDRVLDO        */
#define _RAC_TX_PAENLDOHVPDRVLDO_MASK                                 0x4000000UL                                 /**< Bit mask for RAC_PAENLDOHVPDRVLDO           */
#define _RAC_TX_PAENLDOHVPDRVLDO_DEFAULT                              0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENLDOHVPDRVLDO_disable                              0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENLDOHVPDRVLDO_enable                               0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENLDOHVPDRVLDO_DEFAULT                               (_RAC_TX_PAENLDOHVPDRVLDO_DEFAULT << 26)    /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENLDOHVPDRVLDO_disable                               (_RAC_TX_PAENLDOHVPDRVLDO_disable << 26)    /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENLDOHVPDRVLDO_enable                                (_RAC_TX_PAENLDOHVPDRVLDO_enable << 26)     /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENLDOHVPREREG                                        (0x1UL << 27)                               /**< PAENLDOHVPREREG                             */
#define _RAC_TX_PAENLDOHVPREREG_SHIFT                                 27                                          /**< Shift value for RAC_PAENLDOHVPREREG         */
#define _RAC_TX_PAENLDOHVPREREG_MASK                                  0x8000000UL                                 /**< Bit mask for RAC_PAENLDOHVPREREG            */
#define _RAC_TX_PAENLDOHVPREREG_DEFAULT                               0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENLDOHVPREREG_disable                               0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENLDOHVPREREG_enable                                0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENLDOHVPREREG_DEFAULT                                (_RAC_TX_PAENLDOHVPREREG_DEFAULT << 27)     /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENLDOHVPREREG_disable                                (_RAC_TX_PAENLDOHVPREREG_disable << 27)     /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENLDOHVPREREG_enable                                 (_RAC_TX_PAENLDOHVPREREG_enable << 27)      /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_PAENPAOUT                                              (0x1UL << 28)                               /**< PAENPAOUT                                   */
#define _RAC_TX_PAENPAOUT_SHIFT                                       28                                          /**< Shift value for RAC_PAENPAOUT               */
#define _RAC_TX_PAENPAOUT_MASK                                        0x10000000UL                                /**< Bit mask for RAC_PAENPAOUT                  */
#define _RAC_TX_PAENPAOUT_DEFAULT                                     0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define _RAC_TX_PAENPAOUT_disable                                     0x00000000UL                                /**< Mode disable for RAC_TX                     */
#define _RAC_TX_PAENPAOUT_enable                                      0x00000001UL                                /**< Mode enable for RAC_TX                      */
#define RAC_TX_PAENPAOUT_DEFAULT                                      (_RAC_TX_PAENPAOUT_DEFAULT << 28)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_PAENPAOUT_disable                                      (_RAC_TX_PAENPAOUT_disable << 28)           /**< Shifted mode disable for RAC_TX             */
#define RAC_TX_PAENPAOUT_enable                                       (_RAC_TX_PAENPAOUT_enable << 28)            /**< Shifted mode enable for RAC_TX              */
#define RAC_TX_ENXOSQBUFFILT                                          (0x1UL << 29)                               /**< Override                                    */
#define _RAC_TX_ENXOSQBUFFILT_SHIFT                                   29                                          /**< Shift value for RAC_ENXOSQBUFFILT           */
#define _RAC_TX_ENXOSQBUFFILT_MASK                                    0x20000000UL                                /**< Bit mask for RAC_ENXOSQBUFFILT              */
#define _RAC_TX_ENXOSQBUFFILT_DEFAULT                                 0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENXOSQBUFFILT_DEFAULT                                  (_RAC_TX_ENXOSQBUFFILT_DEFAULT << 29)       /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_ENPAPOWER                                              (0x1UL << 30)                               /**< Override                                    */
#define _RAC_TX_ENPAPOWER_SHIFT                                       30                                          /**< Shift value for RAC_ENPAPOWER               */
#define _RAC_TX_ENPAPOWER_MASK                                        0x40000000UL                                /**< Bit mask for RAC_ENPAPOWER                  */
#define _RAC_TX_ENPAPOWER_DEFAULT                                     0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPAPOWER_DEFAULT                                      (_RAC_TX_ENPAPOWER_DEFAULT << 30)           /**< Shifted mode DEFAULT for RAC_TX             */
#define RAC_TX_ENPASELSLICE                                           (0x1UL << 31)                               /**< Override                                    */
#define _RAC_TX_ENPASELSLICE_SHIFT                                    31                                          /**< Shift value for RAC_ENPASELSLICE            */
#define _RAC_TX_ENPASELSLICE_MASK                                     0x80000000UL                                /**< Bit mask for RAC_ENPASELSLICE               */
#define _RAC_TX_ENPASELSLICE_DEFAULT                                  0x00000000UL                                /**< Mode DEFAULT for RAC_TX                     */
#define RAC_TX_ENPASELSLICE_DEFAULT                                   (_RAC_TX_ENPASELSLICE_DEFAULT << 31)        /**< Shifted mode DEFAULT for RAC_TX             */

